import React from "react";
import {swapClass} from "./Header"

class Content extends React.Component {
render() {
    return (
        <div>
            <p id="sec_el" className="s_class" onClick={change}>Дата та місце народження: 21 липня 2002 року, м.Київ</p>
            <p>Освіта:
                <br/>Броварський Навчально Виховний Комплекс., м.Бровари, Київська обл.
                <br/>НТУУ "КПІ", м.Київ
            </p>
            <h4>Хоббі:</h4>
            <ul>
                <li>Малювання</li>
                <li>Аніме</li>
                <li>Фільми</li>
                <li>Тяжка музика</li>
                <li>Музичні інструменти</li>
                <li>Комп'ютерні ігри</li>
            </ul>
            <h4>Улюблені фільми:</h4>
            <ol>
                <li>"Авріл та підроблений світ", 2015р.</li>
                <li>"Роботи", 2015р.</li>
                <li>"9", 2009р.</li>
                <li>"Спайдервік: Хроніки", 2008р.</li>
            </ol>
            <h4>Кривий Ріг</h4>
            <p>Була там в класі дев'ятому. Напевне, так сподобалось через людей, які були зі мною. Але і саме місто має свої цікавинки. </p>
            <p>Перше про що дізнаються гості міста - це наземне метро! Взагалі вся ваша прогулянка буде супроводжуватись духом індустріалізації. </p>
            <p>Трішки цікавих фактів:</p>
            <ul>
                <li>Місто в Україні, у Дніпропетровській області;</li>
                <li>Восьме за населенням та друге за площею місто країни;</li>
                <li>Був заснований у 1775 році козаками;</li>
                <li>Великий індустріальний центр України;</li>
                <li>У Кривому Розі нараховується близько 5 тисяч джерел забруднення атмосферного повітря.</li>
            </ul>
        </div>
        )
    }
}

function change(e){
    var s_el = document.querySelector("h2#first_el");
    var f_el = e.target;
    swapClass(f_el,s_el,"QuerySelector");
}
export default Content